Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.CanBeDivisionProfile(Autodesk.Revit.DB.ElementId)
Checks whether a family defines a profile which can be used by this method.
familyId:
Element id of the family.
Returns:
True if the family defines a profile which can be used by a part maker,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.CanBeDivisionProfile(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document)
Checks whether a family defines a profile which can be used by this method.
familyId:
Element id of the family.
familyDocument:
The document containing the family to be tested.
Returns:
True if the family defines a profile which can be used by a part maker,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.RemoveIntersectingReference(Autodesk.Revit.DB.ElementId)
Removed intersecting reference.
intersectingReference:
Id of the intersecting reference to remove.
Returns:
True if the PartMaker used this intersecting reference and
this call removed it, false if the PartMaker did not use this
intersecting reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id was not permitted as intersecting references.
Intersecting references should be levels, grids, or reference planes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.AddIntersectingReference(Autodesk.Revit.DB.ElementId,System.Double)
Adds intersecting reference with an offset.
intersectingReference:
Id of the new intersecting reference.
offset:
The Offste for the new intersecting reference.
Returns:
True if the PartMaker did not already use this
intersecting reference and it was added, false if the PartMaker
already used this intersecting reference and this call
only updated its offset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id was not permitted as intersecting references.
Intersecting references should be levels, grids, or reference planes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.GetOffsetForIntersectingReference(Autodesk.Revit.DB.ElementId)
Gets offset for the intersecting reference.
intersectingReference:
The intersecting reference to obtain offset value from.
Returns:
The offset for the intersecting reference
Throws Autodesk.Revit.Exceptions.ArgumentException:
PartMaker does not use the specified intersecting reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.SetOffsetForIntersectingReference(Autodesk.Revit.DB.ElementId,System.Double)
Sets offset for the intersecting reference.
intersectingReference:
The intersecting reference that will be offset.
offset:
The new offset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
PartMaker does not use the specified intersecting reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.UsesReference(Autodesk.Revit.DB.ElementId)
Identifies if the PartMaker uses the intersecting reference.
intersectingReference:
Intersecting reference to be tested.
Returns:
True if the intersecting reference is used by the PartMaker.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.IsValidSketchPlane(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies if provided sketch plane is valid.
document:
The document.
sketchPlaneId:
SketchPlane ids to be tested for validity for PartMaker.
Returns:
True if SketchPlane valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.AreElementsValidIntersectingReferences(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Identifies if provided members are valid.
document:
The document.
elementIds:
Element ids to be tested for validity for intersecting references.
Returns:
True if all references are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.AreElementsValidIntersectingReferences(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Identifies if provided members are valid.
elementIds:
Element ids to be tested for validity for intersecting references.
Returns:
True if all references are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.IsElementValidIntersectingReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies if the provided member is valid.
document:
The document.
elementId:
Element ids to be tested for validity for intersecting references.
Returns:
True if the reference is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.IsElementValidIntersectingReference(Autodesk.Revit.DB.ElementId)
Identifies if the provided member is valid.
elementId:
Element ids to be tested for validity for intersecting references.
Returns:
True if the reference is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.GetSplitRefsOffsets
Returns offsets for plane-defining splitters.
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.GetPlaneOfSketch
Gets the plane of the sketch.
Returns:
The plane of the sketch.
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.GetSketchCurves(System.Collections.Generic.IList{Autodesk.Revit.DB.Curve}@)
Populates the array with copies of curves in the sketch.
curveArray:
Curves in the sketch. Tags of the curves are consistent with the curve tags
used in part keys.
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.DivisionPatternMirror
Whether pattern defined by the division rule should be mirrored before application
Mirroring is similar to changing indices of u-const gridlines.
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.DivisionRotationAngle
Angle by which both u- and v- gridlines of the division are rotated with respect
to the natural u/v-const directions of the sketch plane.
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.VConstDivisionIndent
Indentation for the application of division rule's pattern across v-const gridlines
(i.e., similar to changing indices of v-const gridlines).
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.UConstDivisionIndent
Indentation for the application of division rule's pattern across u-const gridlines
(i.e., similar to changing indices of u-const gridlines).
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.DivisionRuleId
Id of the 'DivisionRule' which is used to augment the cutting sketch.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The provided element id cannot be assigned as a division rule
to this PartMakerMethodToDivideVolumes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.ProfileFlipAlong
True if the corresponding left/upper parts profile are mirrored with respect
to the center line of the hosts to be divided. False if the profile of
left/upper parts are defined directly by the profile family.
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.ProfileFlipAcross
True if the corresponding left/upper parts profile are mirrored with respect
to the division line. False if the profile of left/upper parts are defined
directly by the profile family.
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.ProfileType
The id of the profile family applied to boundaries between parts.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.ProfileOffset
The offset which is applied to a family-defined profile in the
direction away from the division line and toward left/upper part
to obtain its profile.
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.DivisionGap
The gap which is created between matching profiles of parts.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for divisionGap must be between 0 and 30000 feet.
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.ProfileMatch
Determines how two profiles match.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes
By-References dividing strategy used by PartMaker element.
TODO_REFACTOR("LegacyMechanismOfMovingElements")
returns true if
- the Host Elements are not floors or walls
- OR
- the Host Elements that are referenced by this PartMaker are floors or walls
- transformation has already been applied on those Host Elements
Since:
2013